#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vtad/gh-actions-snowflake/runs/run-LP4PxWdpve9Jkqe3

Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Initializing plugins and modules...
snowflake_database.raw_db: Refreshing state... [id=RAW_DB]
snowflake_database.integration_db: Refreshing state... [id=INTEGRATION_DB]
snowflake_database.datamart_db: Refreshing state... [id=DATAMART_DB]
snowflake_user.user_joao: Refreshing state... [id=joao]
snowflake_user.user_dbt: Refreshing state... [id=dbt]
snowflake_user.user_gabriel: Refreshing state... [id=gabriel]
snowflake_user.user_etl: Refreshing state... [id=etl]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_user.user_matias will be created
  + resource "snowflake_user" "user_matias" {
      + comment            = "for testing"
      + default_role       = (known after apply)
      + disabled           = (known after apply)
      + display_name       = (known after apply)
      + has_rsa_public_key = (known after apply)
      + id                 = (known after apply)
      + login_name         = (known after apply)
      + name               = "matias"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @vinicius-dourado, Action: `pull_request`, Working Directory: ``, Workflow: `Snowflake Terraform Demo Workflow`*